{
  "stories": [
    {
      "id": "sleepy_floating_pillow",
      "mood": "sleepy",
      "title": "The Floating Pillow",
      "art": "assets/art/sleepy-floating-pillow.png",
      "text": [
        "Once upon a quiet night, {{name}} found a pillow that felt lighter than air. When {{name}} rested their head on it, the pillow slowly floated up, drifting through the moonlit sky. Stars winked softly as the pillow carried {{name}} past glowing clouds and sleepy owls. Far below, rooftops looked like tiny squares, and the world felt peaceful and still. A warm breeze wrapped around {{name}} like a hug, and the night smelled faintly of dreams.",
        "The pillow hummed a gentle tune, soft and steady, like a lullaby only the night could sing. With every note, {{name}}’s breathing slowed and their eyes grew heavier and heavier. Soon, the pillow floated back down, placing {{name}} safely in bed. Wrapped in warmth and calm, {{name}} sighed happily and drifted into the deepest, coziest sleep."
      ]
    },
    {
      "id": "sleepy_cloud_counting",
      "mood": "sleepy",
      "title": "Cloud Counting",
      "art": "assets/art/sleepy-cloud-counting.png",
      "text": [
        "Tonight, {{name}} counted clouds instead of sheep. One fluffy cloud… two sleepy clouds… three drifting clouds… Each cloud floated across the sky like it had nowhere to be and all the time in the world. Some clouds looked like pillows, others like soft mountains, and one even looked like a smiling bunny before slowly melting away.",
        "A cool night breeze whispered through the sky, guiding the clouds along their quiet path. {{name}} imagined lying on each cloud, sinking softly into its cottony shape, feeling lighter and lighter. Four glowing clouds drifted past the moon, their edges shining gently like lanterns in the dark. Five clouds yawned and stretched, ready to rest.",
        "The counting grew slower, the numbers quieter. Thoughts softened and faded like mist. By the time {{name}} reached the next cloud, the counting slipped away completely — and sleep gently arrived all on its own, wrapping {{name}} in calm, dreamy stillness."
      ]
    },
    {
  "id": "the-very-sleepy-caterpillar",
  "mood": "sleepy",
  "title": "The Very Sleepy Caterpillar",
  "art": "assets/art/sleepy-caterpillar.jpeg",
  "text": [
    "On a quiet leaf beneath the stars, a very sleepy caterpillar curled up and sighed.",
    "{{name}} found the caterpillar while the evening was settling in. The sky had turned soft and dark, and the air felt slow and gentle, like it was ready for rest.",
    "The caterpillar moved carefully along the leaf, stretching and yawning as it went. It had spent the whole day nibbling and exploring, and now its tiny body felt heavy with tiredness.",
    "{{name}} sat nearby, watching as the caterpillar paused and looked up at the moon. The moon glowed kindly, shining just enough light to make everything feel safe. The caterpillar gave a tiny yawn, copying the moon, and smiled.",
    "Slowly, the caterpillar began to spin a silky cocoon. Each wrap was calm and unhurried. There was no rush. Night had plenty of time.",
    "{{name}} noticed how peaceful it looked, working gently and then resting, working gently and then resting again. It felt like a reminder that it was okay to slow down.",
    "Once the cocoon was finished, the caterpillar snuggled inside. It felt warm and protected, like being wrapped in the softest blanket.",
    "{{name}} closed their eyes for a moment, breathing slowly. The world felt quiet and kind.",
    "As sleep arrived, the caterpillar drifted off, dreaming of tomorrow — but not worrying about it. Tonight was only for rest.",
    "And with that calm thought, {{name}} let sleep gently take over too."
      ]
    },
    {
  "id": "the-yawning-moon",
  "mood": "sleepy",
  "title": "The Yawning Moon",
  "art": "assets/art/yawning-moon.jpeg",
  "text": [
    "High above the quiet world, the moon stretched and yawned.",
    "{{name}} noticed it right away. The moon wasn’t bright and busy tonight — it looked soft and drowsy, glowing gently as if it had been awake for a very long time.",
    "Down below, everything seemed to follow the moon’s lead. The trees slowed their swaying. The rooftops rested under the silver light. Even the air felt calmer, like it was settling in for the night.",
    "{{name}} watched from the window as the moon opened its mouth in a slow, glowing yawn. It didn’t rush. It didn’t try to hide it. The yawn drifted down through the sky and wrapped around the world like a quiet invitation to rest.",
    "Feeling sleepy, {{name}} climbed into bed. The blanket felt just right — warm, familiar, and comforting. Each breath grew softer, matching the rhythm of the moon above.",
    "Outside, the stars blinked slowly, one by one, as if they were getting tired too. The moon smiled gently, its glow dimming just enough to be soothing. It stayed watchful, but relaxed, happy to keep the night safe.",
    "{{name}} let their eyes close. Thoughts floated away like clouds passing in front of the moon. Nothing needed attention now. Nothing needed fixing.",
    "As sleep arrived, the moon gave one final, quiet yawn — a promise to stay until morning.",
    "And under its gentle light, {{name}} drifted peacefully into dreams, held by the calm of the night."
      ]
    },
    {
  "id": "the-birthday-cake-fiasco",
  "mood": "hungry",
  "title": "The Birthday Cake Fiasco",
  "art": "assets/art/birthday-cake-fiasco.png",
  "text": [
    "It began with a gasp.",
    "“The cake!” {{name}} exclaimed.",
    "There were twenty minutes until the birthday celebration, and the cake was… still just an idea.",
    "A very important idea.",
    "The kitchen sprang into action. A cupboard was opened too fast. A bowl wobbled. A recipe was read upside down.",
    "“Oh no,” {{name}} laughed. “This might be a fiasco.”",
    "Flour dusted the counter like unexpected snow. Someone grabbed sugar when they meant salt. The spoon went missing, reappeared, and then vanished again, clearly enjoying the drama.",
    "The oven beeped impatiently.",
    "“This is fine,” {{name}} said bravely, even as things became messier.",
    "Batter splashed. The cake pan tilted. A tiny trail of frosting appeared where frosting absolutely did not belong.",
    "And then — laughter.",
    "Big, unstoppable laughter.",
    "The Birthday Cake Fiasco had officially arrived.",
    "But something wonderful happened inside the chaos.",
    "Everyone helped. The mistakes turned into jokes. The kitchen filled with warmth instead of worry.",
    "At last, the cake went into the oven — slightly lopsided, undeniably hopeful.",
    "When it came out, it wasn’t perfect.",
    "It was better.",
    "It was real.",
    "Later, as the lights dimmed and the excitement settled, {{name}} felt cozy and content.",
    "Some of the best memories come from moments that almost go wrong.",
    "And as the day gently ended, the fiasco turned into a story worth keeping — one that carried {{name}} softly into a peaceful, happy sleep."
      ]
    },
    {
  "id": "shenanigans-in-the-freezer",
  "mood": "hungry",
  "title": "Shenanigans in the Freezer",
  "art": "assets/art/freezer.png",
  "text": [
    "The freezer door opened with a dramatic creeeak.",
    "“Oh,” {{name}} whispered. “This looks suspicious.”",
    "Inside the freezer was a mysterious world of frosty shapes and forgotten treasures. Boxes leaned at funny angles. Something sparkled. Something else slid just a little when no one was looking.",
    "{{name}} reached in carefully.",
    "Suddenly — shffft! — a small avalanche of chilly surprises shifted.",
    "“Oh no,” {{name}} laughed. “Shenanigans.”",
    "A frosty bag scooted forward. A box hid behind another box as if playing a game. Even the freezer light flickered, clearly enjoying the moment.",
    "“This is getting out of hand,” {{name}} said, smiling.",
    "The freezer, however, did not agree.",
    "Something gently bumped the door. Something else made a soft thud. Nothing was actually wrong — it was just one of those silly moments where everything decided to be a little mischievous at once.",
    "{{name}} paused, took a breath, and laughed again.",
    "Instead of rushing, {{name}} slowed down.",
    "One thing at a time.",
    "The freezer calmed. The boxes settled. Order returned, though not without a final tiny slide — just to keep things interesting.",
    "At last, the door closed.",
    "“Well,” {{name}} said, “that was an adventure.”",
    "Later, as the evening grew quieter and the house softened into night, the memory of freezer shenanigans felt warm and funny.",
    "Some moments don’t need fixing.",
    "They just need a smile.",
    "And with that gentle thought, {{name}} drifted into a peaceful sleep, carrying the silliness of the day into kind, happy dreams."
      ]
    },
    {
      "id": "hungry_midnight_pancake_quest",
      "mood": "hungry",
      "title": "The Midnight Pancake Quest",
      "art": "assets/art/hungry-pancake-quest.png",
      "text": [
        "{{name}}’s tummy rumbled like a tiny thunderstorm. {{name}} put on a brave face and a chef hat that was definitely too big.",
        "{{name}} and Munchkin Boo sneaked into the kitchen like two secret agents. The mission: pancakes.",
        "Munchkin Boo mixed the batter with dramatic seriousness. {{name}} guarded the blueberries like precious treasure. When the first pancake landed in the pan—sizzle!—it smelled like happiness.",
        "They built a pancake tower and crowned it with a blueberry on top. One bite later, the thunderstorm tummy turned into a satisfied purr.",
        "“Mission complete,” whispered Munchkin Boo. {{name}} grinned. “Best mission ever.”"
      ]
    },
    {
      "id": "hungry_famous_sandwich",
      "mood": "hungry",
      "title": "The Sandwich That Wanted to Be Famous",
      "art": "assets/art/hungry-famous-sandwich.png",
      "text": [
        "{{name}} opened the fridge and found a sandwich wrapped like a present. A tiny note said, “I’m destined for greatness.”",
        "{{name}} laughed softly and called Munchkin Boo to help. Together, they rolled out the sandwich’s “red carpet”: a plate, a fancy napkin, and two dramatic pickles on the side.",
        "The sandwich stood tall—bread, cheese, tomato, and a brave leaf of lettuce. {{name}} took a bite.",
        "“Oh!” {{name}} said. “You are famous.” The sandwich—if sandwiches could—would have blushed.",
        "And the fridge? It applauded silently, as fridges do."
      ]
    },
    {
      "id": "naughty_missing_cookies",
      "mood": "naughty",
      "title": "The Case of the Missing Cookies",
      "art": "assets/art/naughty-missing-cookies.png",
      "text": [
        "Munchkin Boo gasped. “{{name}}! The cookie jar is suspiciously lighter!”",
        "{{name}}’s eyes went wide. “That’s… very suspicious.”",
        "Together, {{name}} and Munchkin Boo investigated the kitchen. Clue #1: crumbs near the counter. Clue #2: a tiny chocolate smudge. Clue #3: a sock on the floor that absolutely did not belong there.",
        "Suddenly, the cat waddled by—round, slow, and extremely innocent-looking. Munchkin Boo narrowed their eyes. “Aha. The Cookie Bandit!”",
        "The cat meowed as if to say, No comment. {{name}} laughed. “We’ve been out-naughtied.”",
        "So they made a new batch of cookies together—this time with extra “security measures,” which was really just Munchkin Boo standing guard like a very serious marshmallow."
      ]
    },
    {
      "id": "naughty_button_mischief",
      "mood": "naughty",
      "title": "The Great Button Mischief",
      "art": "assets/art/naughty-button-mischief.png",
      "text": [
        "{{name}} found a jar of colorful buttons and declared, “These are treasure.”",
        "Munchkin Boo nodded wisely. “Then we must protect the treasure… by hiding it.”",
        "They hid buttons in silly places: one on the bookshelf like a secret jewel, one in a slipper like a surprise, and one right on Munchkin Boo’s nose (the best hiding spot of all).",
        "When {{name}}’s family noticed the mysterious buttons, they started laughing and searching like it was a scavenger hunt.",
        "At the end, Munchkin Boo made a grand speech: “The treasure was never the buttons… it was the giggles.”",
        "{{name}} bowed deeply. “We are very naughty.” Munchkin Boo bowed back. “And very proud.”"
      ]
    },
    {
      "id": "adventure_moon_lantern",
      "mood": "adventure",
      "title": "The Moon Lantern Adventure",
      "type": "choose_your_own",
      "art": "assets/art/moon-lantern.png",
      "start": "a1",
      "nodes": {
        "a1": {
          "text": [
            "Tonight feels different.",
            "{{name}} notices a soft silver glow drifting outside the window.",
            "Munchkin Boo whispers, “That looks like a moon lantern… they only appear when someone is ready for a gentle adventure.”"
          ],
          "choices": [
            { "label": "Follow the glow", "next": "a2" },
            { "label": "Peek from the window", "next": "a3" }
          ]
        },
        "a2": {
          "text": [
            "{{name}} steps quietly outside, the lantern floating just ahead like it knows the way.",
            "The air feels calm and warm, like a deep bedtime breath."
          ],
          "choices": [
            { "label": "Walk toward the trees", "next": "a4" },
            { "label": "Sit and listen", "next": "a5" }
          ]
        },
        "a3": {
          "text": [
            "From the window, {{name}} watches the lantern bob gently.",
            "It flickers once, as if inviting someone brave and cozy."
          ],
          "choices": [
            { "label": "Open the window", "next": "a2" },
            { "label": "Wave goodnight", "next": "a6" }
          ]
        },
        "a4": {
          "text": [
            "Between the trees, fireflies blink like tiny stars.",
            "Munchkin Boo smiles. “The forest is saying hello.”"
          ],
          "choices": [
            { "label": "Follow the fireflies", "next": "a7" },
            { "label": "Rest on a soft log", "next": "a5" }
          ]
        },
        "a5": {
          "text": [
            "{{name}} sits still.",
            "The lantern lowers, glowing softly.",
            "Everything feels peaceful and slow."
          ],
          "choices": [
            { "label": "Close your eyes", "next": "a8" }
          ]
        },
        "a6": {
          "text": [
            "{{name}} waves gently.",
            "The lantern glows brighter, then floats up toward the moon.",
            "It feels like a promise for another night."
          ],
          "choices": [
            { "label": "Snuggle into bed", "next": "a8" }
          ]
        },
        "a7": {
          "text": [
            "The fireflies swirl into a tiny glowing path.",
            "{{name}} follows it, feeling light and safe."
          ],
          "choices": [
            { "label": "Lie beneath the stars", "next": "a8" }
          ]
        },
        "a8": {
          "text": [
            "The lantern drifts higher, fading into moonlight.",
            "Munchkin Boo whispers, “Adventure complete.”",
            "{{name}} smiles and drifts off into a gentle slumber…"
          ],
          "choices": []
        }
      }
    },
    {
      "id": "adventure_river_lights",
      "mood": "adventure",
      "title": "The River of Quiet Lights",
      "type": "choose_your_own",
      "art": "assets/art/adventure-river-lights.png",
      "start": "b1",
      "nodes": {
        "b1": {
          "text": [
            "The night is very still.",
            "{{name}} notices a soft shimmer moving through the grass, like tiny stars floating on water.",
            "Munchkin Boo whispers, “That’s the River of Quiet Lights… it only appears when the world is ready to slow down.”"
          ],
          "choices": [
            { "label": "Follow the shimmer", "next": "b2" },
            { "label": "Sit and watch", "next": "b3" }
          ]
        },
        "b2": {
          "text": [
            "{{name}} walks gently beside the glowing river.",
            "Each step feels calm, like walking through a deep breath."
          ],
          "choices": [
            { "label": "Listen to the water", "next": "b4" },
            { "label": "Touch the light", "next": "b5" }
          ]
        },
        "b3": {
          "text": [
            "{{name}} sits quietly.",
            "The lights drift past, slow and steady, as if they are in no hurry at all."
          ],
          "choices": [
            { "label": "Close your eyes", "next": "b6" },
            { "label": "Stand up slowly", "next": "b2" }
          ]
        },
        "b4": {
          "text": [
            "The river makes a soft humming sound.",
            "Munchkin Boo smiles. “That’s the sound of the day settling down.”"
          ],
          "choices": [
            { "label": "Hum along", "next": "b7" },
            { "label": "Lie on the grass", "next": "b6" }
          ]
        },
        "b5": {
          "text": [
            "{{name}} reaches out.",
            "The light feels warm, like holding a tiny moon."
          ],
          "choices": [
            { "label": "Let it float away", "next": "b7" },
            { "label": "Hold it close", "next": "b8" }
          ]
        },
        "b6": {
          "text": [
            "{{name}} rests.",
            "The ground feels soft and safe.",
            "Everything slows."
          ],
          "choices": [
            { "label": "Breathe deeply", "next": "b9" }
          ]
        },
        "b7": {
          "text": [
            "The lights begin to drift upward, one by one.",
            "The river grows quieter, like it’s whispering goodnight."
          ],
          "choices": [
            { "label": "Watch the sky", "next": "b9" }
          ]
        },
        "b8": {
          "text": [
            "{{name}} holds the gentle glow.",
            "It slowly fades, leaving behind a warm, peaceful feeling."
          ],
          "choices": [
            { "label": "Smile softly", "next": "b9" }
          ]
        },
        "b9": {
          "text": [
            "The River of Quiet Lights becomes still.",
            "Munchkin Boo whispers, “The night has everything it needs now.”"
          ],
          "choices": [
            { "label": "Snuggle into sleep", "next": "b10" }
          ]
        },
        "b10": {
          "text": [
            "The last light fades into the stars.",
            "{{name}} feels calm, safe, and warm.",
            "{{name}} smiles and drifts off into a gentle slumber…"
          ],
          "choices": []
        }
      }
    }
  ]
}
